src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиAPI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_HTTPМетодAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_СпособПолученияДанныхAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМетодаОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторТипИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ТипИсточникаКонструктораAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторВиртуальнаяТаблица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторПараметрПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторОтборыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОтвета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ФорматОтветаAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JSONПараметрыЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСопоставления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МС_СпособСопоставленияПараметраОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТестовыеЗначенияПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/CommonModules/МС_HTTPAPIСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обрабатывает запрос к HTTP-сервису МС_HTTPAPI (все методы шаблона URL).
//
// Параметры:
//  Запрос - HTTPСервисЗапрос - входящий запрос.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - данные по настройке API или описание ошибки.
//
Функция ОбработатьЗапрос(Запрос) Экспорт

	Попытка
		Возврат ОбработатьЗапросВнутр(Запрос);
	Исключение
		Информация = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(Информация));
		Возврат ОтветОшибкиСервиса(500, КраткоеПредставлениеОшибки(Информация), Перечисления.МС_ФорматОтветаAPI.JSON, "");
	КонецПопытки;

КонецФункции

// Выполняет сохраненную настройку так же, как HTTP-вызов. Параметры берутся
// из табличной части "Тестовые значения параметров"; незаполненные считаются не переданными.
//
// Параметры:
//  СсылкаНастройки - СправочникСсылка.МС_НастройкиAPI - проверяемая настройка.
//
// Возвращаемое значение:
//  Строка - тело ответа или текст ошибки.
//
Функция ВыполнитьНастройкуВТестовомРежиме(Знач СсылкаНастройки) Экспорт

	Попытка
		ДанныеНастройки = ДанныеНастройкиAPIПоСсылке(СсылкаНастройки);
		ПараметрыВнешние = ПараметрыИзТестовыхЗначений(ДанныеНастройки);
		ТекстОшибки = ОшибкаОбязательныхПараметров(ДанныеНастройки, ПараметрыВнешние);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Возврат "Ошибка: " + ТекстОшибки;
		КонецЕсли;
		Данные = ПолучитьДанныеПоНастройке(ДанныеНастройки, ПараметрыВнешние, "");
		Возврат СериализоватьДанные(ДанныеНастройки, Данные);
	Исключение
		Возврат "Ошибка: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецФункции

// Формирует пример тела ответа: настройка выполняется без параметров.
//
// Параметры:
//  СсылкаНастройки - СправочникСсылка.МС_НастройкиAPI - настройка.
//
// Возвращаемое значение:
//  Строка - тело ответа или текст ошибки.
//
Функция СформироватьПримерОтвета(Знач СсылкаНастройки) Экспорт

	Попытка
		ДанныеНастройки = ДанныеНастройкиAPIПоСсылке(СсылкаНастройки);
		Данные = ПолучитьДанныеПоНастройке(ДанныеНастройки, Новый Соответствие, "");
		Возврат СериализоватьДанные(ДанныеНастройки, Данные);
	Исключение
		Возврат "Ошибка примера: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецФункции

// Возвращает уникальные имена параметров вида &Имя из текста запроса.
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса на языке запросов 1С.
//
// Возвращаемое значение:
//  Массив из Строка - имена параметров в порядке появления.
//
Функция ИменаПараметровТекстаЗапроса(Знач ТекстЗапроса) Экспорт

	Результат = Новый Массив;
	УжеДобавлены = Новый Соответствие;
	ДлинаТекста = СтрДлина(ТекстЗапроса);
	Позиция = СтрНайти(ТекстЗапроса, "&");
	Пока Позиция > 0 Цикл
		ИмяПараметра = ИзвлечьИмяПараметраЗапросаИзТекста(ТекстЗапроса, Позиция + 1, ДлинаТекста);
		Если ЗначениеЗаполнено(ИмяПараметра) И УжеДобавлены.Получить(ВРег(ИмяПараметра)) = Неопределено Тогда
			УжеДобавлены.Вставить(ВРег(ИмяПараметра), Истина);
			Результат.Добавить(ИмяПараметра);
		КонецЕсли;
		Позиция = СтрНайти(ТекстЗапроса, "&", , Позиция + 1 + СтрДлина(ИмяПараметра));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Сверяет параметры &Имя в тексте запроса с табличной частью "Параметры запроса".
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса.
//  ПараметрыЗапроса - ТабличнаяЧасть, ДанныеФормыКоллекция - описания параметров API.
//
// Возвращаемое значение:
//  Строка - описание расхождения или пустая строка.
//
Функция ОшибкаСоответствияПараметровИТекстаЗапроса(Знач ТекстЗапроса, ПараметрыЗапроса) Экспорт

	ИменаВТексте = Новый Соответствие;
	Для Каждого Имя Из ИменаПараметровТекстаЗапроса(ТекстЗапроса) Цикл
		ИменаВТексте.Вставить(ВРег(Имя), Имя);
	КонецЦикла;
	ИменаВТаблице = ИменаОписанныхПараметров(ПараметрыЗапроса);
	ЛимитСтрок = ВРег(ИмяПараметраЛимитСтрок());

	Для Каждого КлючИЗначение Из ИменаВТексте Цикл
		Если КлючИЗначение.Ключ <> ЛимитСтрок И ИменаВТаблице.Получить(КлючИЗначение.Ключ) = Неопределено Тогда
			Возврат СтрШаблон(
				"В тексте запроса используется параметр ""%1"", но он не описан в табличной части ""Параметры запроса"".",
				КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;

	Для Каждого КлючИЗначение Из ИменаВТаблице Цикл
		Если КлючИЗначение.Ключ <> ЛимитСтрок И ИменаВТексте.Получить(КлючИЗначение.Ключ) = Неопределено Тогда
			Возврат СтрШаблон("В табличной части ""Параметры запроса"" указан параметр ""%1"", но в тексте запроса нет &%1.",
				КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Заполняет "Параметры запроса" по параметрам &Имя из текста запроса. Для уже описанных параметров
// сохраняются признак "Обязательный", тип, источник, способ сопоставления и описание.
//
// Параметры:
//  ОбъектНастройки - ДанныеФормыСтруктура, СправочникОбъект.МС_НастройкиAPI - настройка API.
//
Процедура ЗаполнитьПараметрыЗапросаИзТекстаЗапроса(ОбъектНастройки) Экспорт

	СтарыеПараметры = ОписанияПараметровПоИмени(ОбъектНастройки);
	ОбъектНастройки.ПараметрыЗапроса.Очистить();
	Для Каждого Имя Из ИменаПараметровТекстаЗапроса(ОбъектНастройки.ТекстЗапроса) Цикл
		Если ВРег(Имя) = ВРег(ИмяПараметраЛимитСтрок()) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаПараметра = ОбъектНастройки.ПараметрыЗапроса.Добавить();
		СтрокаПараметра.ИмяПараметра = Имя;
		СтароеОписание = СтарыеПараметры.Получить(Имя);
		Если СтароеОписание <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаПараметра, СтароеОписание);
		КонецЕсли;
	КонецЦикла;

	СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ОбъектНастройки);

КонецПроцедуры

// Выравнивает табличную часть тестовых значений по именам из "Параметры запроса"; введенные значения сохраняются.
//
// Параметры:
//  ОбъектНастройки - ДанныеФормыСтруктура, СправочникОбъект.МС_НастройкиAPI - настройка API.
//
Процедура СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ОбъектНастройки) Экспорт

	Сохраненные = Новый Соответствие;
	Для Каждого СтрокаТеста Из ОбъектНастройки.ТестовыеЗначенияПараметров Цикл
		Имя = СокрЛП(СтрокаТеста.ИмяПараметра);
		Если ЗначениеЗаполнено(Имя) Тогда
			Сохраненные.Вставить(Имя, СтрокаТеста.Значение);
		КонецЕсли;
	КонецЦикла;

	ОбъектНастройки.ТестовыеЗначенияПараметров.Очистить();
	Для Каждого СтрокаПараметра Из ОбъектНастройки.ПараметрыЗапроса Цикл
		Имя = СокрЛП(СтрокаПараметра.ИмяПараметра);
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ОбъектНастройки.ТестовыеЗначенияПараметров.Добавить();
		НоваяСтрока.ИмяПараметра = Имя;
		Значение = Сохраненные.Получить(Имя);
		Если Значение <> Неопределено Тогда
			НоваяСтрока.Значение = Значение;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Заполняет "Параметры запроса" по отборам конструктора, сохраненным в КонструкторОтборыJSON.
//
// Параметры:
//  ОбъектНастройки - СправочникОбъект.МС_НастройкиAPI - настройка API.
//
Процедура ЗаполнитьПараметрыЗапросаИзОтборовКонструктораПоJSON(ОбъектНастройки) Экспорт

	Отборы = МС_HTTPAPIКонструкторСервер.ОтборыКонструктораИзJSON(ОбъектНастройки.КонструкторОтборыJSON);
	ЗаполнитьПараметрыЗапросаПоОтборам(ОбъектНастройки, Отборы);

КонецПроцедуры

// Заполняет "Параметры запроса" по таблице отборов мастера конструктора (до записи элемента).
//
// Параметры:
//  ОбъектНастройки - ДанныеФормыСтруктура - реквизит формы "Объект".
//  ОтборыКонструктора - ДанныеФормыКоллекция - таблица отборов мастера (Поле, ИмяПараметра).
//
Процедура ЗаполнитьПараметрыЗапросаИзТаблицыОтборовКонструктора(ОбъектНастройки, ОтборыКонструктора) Экспорт

	ЗаполнитьПараметрыЗапросаПоОтборам(ОбъектНастройки, ОтборыКонструктора);

КонецПроцедуры

// Базовый адрес HTTP-сервиса МС_HTTPAPI: адрес публикации ИБ + "/hs/" + корневой URL сервиса.
// Адрес публикации берется из настроек БСП (локальная сеть, затем Интернет),
// затем из константы АдресПубликацииНаВебСервере.
//
// Возвращаемое значение:
//   Структура:
//     * Адрес - Строка - например, "http://server/base/hs/sm";
//     * АдресПубликацииЗадан - Булево - Ложь, если адрес публикации не настроен и подставлена заглушка.
//
Функция БазовыйАдресHTTPAPI() Экспорт

	АдресПубликации = АдресПубликацииИнформационнойБазы();
	АдресПубликацииЗадан = ЗначениеЗаполнено(АдресПубликации);
	Если Не АдресПубликацииЗадан Тогда
		АдресПубликации = "http://<сервер>/<публикация>";
	КонецЕсли;

	Адрес = АдресПубликации + "/hs/" + Метаданные.HTTPСервисы.МС_HTTPAPI.КорневойURL;

	Возврат Новый Структура("Адрес, АдресПубликацииЗадан", Адрес, АдресПубликацииЗадан);

КонецФункции

// Настройки записи JSON для реквизитов формы; незаданные и некорректные значения заменяются значениями по умолчанию.
//
// Параметры:
//  СтрокаJSON - Строка - значение реквизита JSONПараметрыЗаписи.
//
// Возвращаемое значение:
//  Структура - см. НастройкиЗаписиJSONПоУмолчанию.
//
Функция НастройкиЗаписиJSONВСтруктуруФормы(Знач СтрокаJSON) Экспорт

	Возврат НастройкиЗаписиJSON(СтрокаJSON);

КонецФункции

// Строка для реквизита JSONПараметрыЗаписи из реквизитов формы.
//
// Параметры:
//  СтруктураНастроек - Структура - см. НастройкиЗаписиJSONПоУмолчанию.
//
// Возвращаемое значение:
//  Строка - настройки в формате JSON.
//
Функция СтрокаНастроекЗаписиJSONИзСтруктурыФормы(Знач СтруктураНастроек) Экспорт

	Настройки = НастройкиЗаписиJSONПоУмолчанию();
	ЗаполнитьЗначенияСвойств(Настройки, СтруктураНастроек);
	Возврат ЗначениеВJSON(Настройки);

КонецФункции

// Варианты формата дат в ответе JSON для списка выбора.
//
// Возвращаемое значение:
//  СписокЗначений - значение - код формата, представление - описание.
//
Функция ВариантыФорматаДатыJSON() Экспорт

	Варианты = Новый СписокЗначений;
	Варианты.Добавить(ФорматДатыISO8601(), "ISO 8601: ""2024-01-31T10:00:00""");
	Варианты.Добавить(ФорматДатыUnixTime(), "Unix-время: число секунд от 01.01.1970 UTC");
	Возврат Варианты;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗапроса

Функция ОбработатьЗапросВнутр(Запрос)

	Версия = Запрос.ПараметрыURL.Получить("Версия");
	ПараметрURL = Запрос.ПараметрыURL.Получить("ПараметрURL");
	ЧастиПути = ЧастиПутиURL(Запрос.ОтносительныйURL);
	Если Не ЗначениеЗаполнено(Версия) Или Не ЗначениеЗаполнено(ПараметрURL) Тогда
		Версия = ?(ЧастиПути.Количество() > 0, ЧастиПути[0], "");
		ПараметрURL = ?(ЧастиПути.Количество() > 1, ЧастиПути[1], "");
	КонецЕсли;

	НастройкаСсылка = НайтиНастройкуAPI(Версия, ПараметрURL, Запрос.HTTPМетод);
	Если НастройкаСсылка.Пустая() Тогда
		Возврат ОтветОшибкиСервиса(404, "Настройка API не найдена", Перечисления.МС_ФорматОтветаAPI.JSON, "");
	КонецЕсли;

	ДанныеНастройки = ДанныеНастройкиAPIПоСсылке(НастройкаСсылка);
	Если Не ДанныеНастройки.Активно Тогда
		Возврат ОтветОшибкиСервиса(503, "Сервис временно недоступен",
			ДанныеНастройки.ФорматОтвета, ДанныеНастройки.ВерсияAPI);
	КонецЕсли;

	ТекстОшибки = "";
	ПараметрыВнешние = СобратьПараметрыИзHTTPЗапроса(Запрос, ТекстОшибки);
	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		ТекстОшибки = ОшибкаОбязательныхПараметров(ДанныеНастройки, ПараметрыВнешние);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат ОтветОшибкиСервиса(400, ТекстОшибки, ДанныеНастройки.ФорматОтвета, ДанныеНастройки.ВерсияAPI);
	КонецЕсли;

	Данные = ПолучитьДанныеПоНастройке(ДанныеНастройки, ПараметрыВнешние, ХвостПути(ЧастиПути));

	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьЗаголовкиОтвета(Ответ, ДанныеНастройки);
	Если ВРег(Запрос.HTTPМетод) <> "HEAD" Тогда
		Ответ.УстановитьТелоИзСтроки(СериализоватьДанные(ДанныеНастройки, Данные), КодировкаТекста.UTF8);
	КонецЕсли;

	Возврат Ответ;

КонецФункции

Функция ЧастиПутиURL(Знач ОтносительныйURL)
	
	// Сегменты относительного URL (относительно корневого URL сервиса): {Версия}/{ПараметрURL}/хвост...

	ПозицияВопроса = СтрНайти(ОтносительныйURL, "?");
	Если ПозицияВопроса > 0 Тогда
		ОтносительныйURL = Лев(ОтносительныйURL, ПозицияВопроса - 1);
	КонецЕсли;

	Возврат СтрРазделить(ОтносительныйURL, "/", Ложь);

КонецФункции

Функция ХвостПути(ЧастиПути)
	
	// Часть пути после версии и параметра URL, например "123/items" для /v1/orders/123/items.

	Хвост = Новый Массив;
	Для Индекс = 2 По ЧастиПути.ВГраница() Цикл
		Хвост.Добавить(ЧастиПути[Индекс]);
	КонецЦикла;

	Возврат СтрСоединить(Хвост, "/");

КонецФункции

Функция НайтиНастройкуAPI(Знач Версия, Знач ПараметрURL, Знач МетодHTTP)

	МетодПеречисление = HTTPМетодПоСтроке(МетодHTTP);
	Если МетодПеречисление = Неопределено Тогда
		Возврат Справочники.МС_НастройкиAPI.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МС_НастройкиAPI.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МС_НастройкиAPI КАК МС_НастройкиAPI
	|ГДЕ
	|	НЕ МС_НастройкиAPI.ПометкаУдаления
	|	И ВРЕГ(МС_НастройкиAPI.ВерсияAPI) = &Версия
	|	И ВРЕГ(МС_НастройкиAPI.ПараметрURL) = &ПараметрURL
	|	И МС_НастройкиAPI.HTTPМетод = &Метод";
	Запрос.УстановитьПараметр("Версия", ВРег(СокрЛП(Версия)));
	Запрос.УстановитьПараметр("ПараметрURL", ВРег(СокрЛП(ПараметрURL)));
	Запрос.УстановитьПараметр("Метод", МетодПеречисление);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.МС_НастройкиAPI.ПустаяСсылка();

КонецФункции

Функция HTTPМетодПоСтроке(Знач МетодHTTP)

	ИмяМетода = ВРег(СокрЛП(МетодHTTP));
	Для Каждого ЗначениеМД Из Метаданные.Перечисления.МС_HTTPМетодAPI.ЗначенияПеречисления Цикл
		Если ВРег(ЗначениеМД.Имя) = ИмяМетода Тогда
			Возврат Перечисления.МС_HTTPМетодAPI[ЗначениеМД.Имя];
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция ДанныеНастройкиAPIПоСсылке(СсылкаНастройки)
	
	// Снимок полей настройки API для выполнения без загрузки объекта справочника.

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МС_НастройкиAPI.Активно КАК Активно,
	|	МС_НастройкиAPI.ВерсияAPI КАК ВерсияAPI,
	|	МС_НастройкиAPI.ФорматОтвета КАК ФорматОтвета,
	|	МС_НастройкиAPI.JSONПараметрыЗаписи КАК JSONПараметрыЗаписи,
	|	МС_НастройкиAPI.СпособПолученияДанных КАК СпособПолученияДанных,
	|	МС_НастройкиAPI.ТекстЗапроса КАК ТекстЗапроса,
	|	МС_НастройкиAPI.ИмяМетодаОбработчика КАК ИмяМетодаОбработчика,
	|	МС_НастройкиAPI.ЛимитСтрок КАК ЛимитСтрок,
	|	МС_НастройкиAPI.КонструкторИмяТаблицы КАК КонструкторИмяТаблицы,
	|	МС_НастройкиAPI.КонструкторВиртуальнаяТаблица КАК КонструкторВиртуальнаяТаблица,
	|	МС_НастройкиAPI.КонструкторПараметрПериода КАК КонструкторПараметрПериода,
	|	МС_НастройкиAPI.КонструкторПоля КАК КонструкторПоля,
	|	МС_НастройкиAPI.КонструкторОтборыJSON КАК КонструкторОтборыJSON
	|ИЗ
	|	Справочник.МС_НастройкиAPI КАК МС_НастройкиAPI
	|ГДЕ
	|	МС_НастройкиAPI.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыЗапроса.ИмяПараметра КАК ИмяПараметра,
	|	ПараметрыЗапроса.Обязательный КАК Обязательный,
	|	ПараметрыЗапроса.ТипПараметра КАК ТипПараметра,
	|	ПараметрыЗапроса.СпособСопоставления КАК СпособСопоставления
	|ИЗ
	|	Справочник.МС_НастройкиAPI.ПараметрыЗапроса КАК ПараметрыЗапроса
	|ГДЕ
	|	ПараметрыЗапроса.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТестовыеЗначения.ИмяПараметра КАК ИмяПараметра,
	|	ТестовыеЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.МС_НастройкиAPI.ТестовыеЗначенияПараметров КАК ТестовыеЗначения
	|ГДЕ
	|	ТестовыеЗначения.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНастройки);
	Результаты = Запрос.ВыполнитьПакет();

	Выборка = Результаты[0].Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение "Не удалось прочитать настройку API по ссылке";
	КонецЕсли;

	Данные = Новый Структура;
	Для Каждого Колонка Из Результаты[0].Колонки Цикл
		Данные.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
	КонецЦикла;
	Данные.Вставить("ПараметрыЗапроса", Результаты[1].Выгрузить());
	Данные.Вставить("ТестовыеЗначенияПараметров", Результаты[2].Выгрузить());

	Возврат Данные;

КонецФункции

Функция СобратьПараметрыИзHTTPЗапроса(Запрос, ТекстОшибки)
	
	// Параметры запроса из строки запроса и тела (объект JSON или application/x-www-form-urlencoded).

	Результат = Новый Соответствие;
	Для Каждого КлючИЗначение Из Запрос.ПараметрыЗапроса Цикл
		Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;

	ТелоСтрока = СокрЛП(Запрос.ПолучитьТелоКакСтроку());
	Если Не ЗначениеЗаполнено(ТелоСтрока) Тогда
		Возврат Результат;
	КонецЕсли;

	Если Не СтрНачинаетсяС(ТелоСтрока, "{") Тогда
		ДобавитьПараметрыИзFormUrlEncoded(ТелоСтрока, Результат);
		Возврат Результат;
	КонецЕсли;

	Попытка
		ДанныеТела = JSONВЗначение(ТелоСтрока, Истина);
	Исключение
		ТекстОшибки = "Тело запроса не является корректным JSON: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;

	Для Каждого КлючИЗначение Из ДанныеТела Цикл
		Результат.Вставить(Строка(КлючИЗначение.Ключ), КлючИЗначение.Значение);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ДобавитьПараметрыИзFormUrlEncoded(ТелоСтрока, Результат)

	Для Каждого Фрагмент Из СтрРазделить(ТелоСтрока, "&", Ложь) Цикл
		Позиция = СтрНайти(Фрагмент, "=");
		Если Позиция = 0 Тогда
			Продолжить;
		КонецЕсли;
		Имя = РаскодироватьСтрокуFormUrlEncoded(Лев(Фрагмент, Позиция - 1));
		Если ЗначениеЗаполнено(Имя) Тогда
			Результат.Вставить(Имя, РаскодироватьСтрокуFormUrlEncoded(Сред(Фрагмент, Позиция + 1)));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция РаскодироватьСтрокуFormUrlEncoded(Знач Стр)

	Возврат РаскодироватьСтроку(СтрЗаменить(Стр, "+", " "), СпособКодированияСтроки.КодировкаURL);

КонецФункции

Функция ПараметрыИзТестовыхЗначений(ДанныеНастройки)
	
	// Тестовые значения как параметры вызова; пустые значения считаются не переданными.

	Результат = Новый Соответствие;
	Для Каждого СтрокаТеста Из ДанныеНастройки.ТестовыеЗначенияПараметров Цикл
		Имя = СокрЛП(СтрокаТеста.ИмяПараметра);
		Если ЗначениеЗаполнено(Имя) И ЗначениеЗаполнено(СтрокаТеста.Значение) Тогда
			Результат.Вставить(Имя, СтрокаТеста.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ОшибкаОбязательныхПараметров(ДанныеНастройки, ПараметрыВнешние)

	Для Каждого СтрокаПараметра Из ДанныеНастройки.ПараметрыЗапроса Цикл
		Имя = СокрЛП(СтрокаПараметра.ИмяПараметра);
		Если СтрокаПараметра.Обязательный И Не ЗначениеПараметраПередано(ПараметрыВнешние.Получить(Имя)) Тогда
			Возврат "Не передан обязательный параметр: " + Имя;
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

Функция ЗначениеПараметраПередано(Значение)
	
	// Ложь и 0 из JSON - переданные значения; пустая строка - нет.

	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Не ПустаяСтрока(Значение);
	КонецЕсли;

	Возврат Значение <> Неопределено;

КонецФункции

Функция ПолучитьДанныеПоНастройке(ДанныеНастройки, ПараметрыВнешние, ХвостПути)

	Способ = ДанныеНастройки.СпособПолученияДанных;
	Если Способ = Перечисления.МС_СпособПолученияДанныхAPI.ТекстЗапроса Тогда
		Возврат ВыполнитьТекстЗапроса(ДанныеНастройки, ПараметрыПоТипам(ДанныеНастройки, ПараметрыВнешние));
	ИначеЕсли Способ = Перечисления.МС_СпособПолученияДанныхAPI.ПрограммныйМодуль Тогда
		ПараметрыОбработчика = Новый Структура("Параметры, ХвостПути",
			ПараметрыПоТипам(ДанныеНастройки, ПараметрыВнешние), ХвостПути);
		Возврат МС_HTTPAPIПользовательскиеОбработчики.ВыполнитьОбработчик(
			ДанныеНастройки.ИмяМетодаОбработчика, ПараметрыОбработчика);
	ИначеЕсли Способ = Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
		// Значения приводятся к типам полей отбора внутри конструктора.
		Возврат ВыполнитьКонструктор(ДанныеНастройки, ПараметрыВнешние);
	Иначе
		ВызватьИсключение "Не указан способ получения данных";
	КонецЕсли;

КонецФункции

Функция ПараметрыПоТипам(ДанныеНастройки, ПараметрыВнешние)
	
	// Приводит строковые значения описанных параметров к типу из колонки "Тип".

	Результат = Новый Соответствие;
	Для Каждого КлючИЗначение Из ПараметрыВнешние Цикл
		СтрокаПараметра = НайтиСтрокуПараметраЗапросаПоИмени(ДанныеНастройки.ПараметрыЗапроса, КлючИЗначение.Ключ);
		ТипПараметра = ?(СтрокаПараметра = Неопределено, "", СтрокаПараметра.ТипПараметра);
		Результат.Вставить(КлючИЗначение.Ключ,
			МС_HTTPAPIКонструкторСервер.ЗначениеПараметраПоТипу(КлючИЗначение.Значение, ТипПараметра));
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ВыполнитьТекстЗапроса(ДанныеНастройки, Параметры)
	
	// Не переданные параметры получают значение Неопределено, поэтому в тексте запроса
	// можно задавать необязательные отборы вида "&Код = НЕОПРЕДЕЛЕНО ИЛИ Т.Код = &Код".

	Если Не ЗначениеЗаполнено(ДанныеНастройки.ТекстЗапроса) Тогда
		ВызватьИсключение "Пустой текст запроса";
	КонецЕсли;

	Запрос = Новый Запрос(ДанныеНастройки.ТекстЗапроса);
	Для Каждого СтрокаПараметра Из ДанныеНастройки.ПараметрыЗапроса Цикл
		Имя = СокрЛП(СтрокаПараметра.ИмяПараметра);
		Если ЗначениеЗаполнено(Имя) Тогда
			Запрос.УстановитьПараметр(Имя, Параметры.Получить(Имя));
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр(ИмяПараметраЛимитСтрок(), ДанныеНастройки.ЛимитСтрок);

	Возврат РезультатЗапросаВМассивСтруктур(Запрос.Выполнить());

КонецФункции

Функция ВыполнитьКонструктор(ДанныеНастройки, ПараметрыВнешние)
	
	// Лимит строк 0 - без ограничения. Отбор по необязательному параметру, который не передан, не применяется.

	ИмяТаблицы = СокрЛП(ДанныеНастройки.КонструкторИмяТаблицы);
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		ВызватьИсключение "Не указано имя таблицы конструктора";
	КонецЕсли;
	Если МС_HTTPAPIКонструкторСервер.ПоляТаблицыЗапроса(ИмяТаблицы).Количество() = 0 Тогда
		ВызватьИсключение "Объект метаданных не найден: " + ИмяТаблицы;
	КонецЕсли;

	// В запросе поля получают технические псевдонимы Поле1, Поле2...: имена в ответе (например, "value",
	// "order") могут совпадать со словами языка запросов. Имена в ответе подставляются при выгрузке результата.
	Поля = МС_HTTPAPIКонструкторСервер.ПоляКонструктораИзСтроки(ДанныеНастройки.КонструкторПоля);
	Если Поля.Количество() = 0 Тогда
		Поля.Добавить(Новый Структура("Поле, ИмяВОтвете, ФорматЗначения, Реквизит", "Ссылка", "", "", ""));
	КонецЕсли;
	ВыраженияПолей = Новый Массив;
	ИменаВОтвете = Новый Массив;
	Для Каждого Поле Из Поля Цикл
		ТекстОшибки = МС_HTTPAPIКонструкторСервер.ОшибкаПоляОтвета(Поле);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ВызватьИсключение "Ошибка в полях конструктора: " + ТекстОшибки;
		КонецЕсли;
		Псевдоним = "Поле" + Формат(ВыраженияПолей.Количество() + 1, "ЧГ=0");
		ВыражениеПоля = МС_HTTPAPIКонструкторСервер.ВыражениеПоляЗапроса(ИмяТаблицы, Поле, "Т");
		ВыраженияПолей.Добавить(СтрШаблон("	%1 КАК %2", ВыражениеПоля.Выражение, Псевдоним));
		ИмяВОтвете = Новый Структура("Псевдоним, Имя, ФорматЗначения",
			Псевдоним, МС_HTTPAPIКонструкторСервер.ИмяПоляВОтвете(Поле), ВыражениеПоля.ФорматВывода);
		ИменаВОтвете.Добавить(ИмяВОтвете);
	КонецЦикла;

	Запрос = Новый Запрос;
	Условия = Новый Массив;
	Для Каждого Отбор Из МС_HTTPAPIКонструкторСервер.ОтборыКонструктораИзJSON(ДанныеНастройки.КонструкторОтборыJSON) Цикл
		ДобавитьУсловиеОтбора(Запрос, Условия, Отбор, ИмяТаблицы, ДанныеНастройки, ПараметрыВнешние);
	КонецЦикла;

	// Срез регистра сведений: период берется из параметра API; не передан - срез на текущий момент.
	ВиртуальнаяТаблица = МС_HTTPAPIКонструкторСервер.ВиртуальнаяТаблицаНастройки(ДанныеНастройки, ИмяТаблицы);
	ИмяПараметраПериода = "ПериодСреза";
	Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
		Запрос.УстановитьПараметр(ИмяПараметраПериода, ПериодСреза(ДанныеНастройки, ПараметрыВнешние));
	КонецЕсли;
	Источник = МС_HTTPAPIКонструкторСервер.ИсточникЗапросаКонструктора(ИмяТаблицы, ВиртуальнаяТаблица,
		ИмяПараметраПериода);

	ТекстЗапроса = "ВЫБРАТЬ"
		+ ?(ДанныеНастройки.ЛимитСтрок > 0, " ПЕРВЫЕ " + Формат(ДанныеНастройки.ЛимитСтрок, "ЧГ=0"), "")
		+ Символы.ПС + СтрСоединить(ВыраженияПолей, "," + Символы.ПС)
		+ Символы.ПС + "ИЗ" + Символы.ПС + "	" + Источник + " КАК Т";
	Если Условия.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ГДЕ" + Символы.ПС + "	" + СтрСоединить(Условия, Символы.ПС + "	И ");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Для Каждого ИмяВОтвете Из ИменаВОтвете Цикл
			Значение = МС_HTTPAPIКонструкторСервер.ЗначениеПоляДляОтвета(Выборка[ИмяВОтвете.Псевдоним], ИмяВОтвете.ФорматЗначения);
			Элемент.Вставить(ИмяВОтвете.Имя, Значение);
		КонецЦикла;
		Результат.Добавить(Элемент);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПериодСреза(ДанныеНастройки, ПараметрыВнешние)

	// Дата из параметра периода; Неопределено - параметр не задан или не передан (срез без ограничения по дате).

	ИмяПараметра = СокрЛП(ДанныеНастройки.КонструкторПараметрПериода);
	Если Не ЗначениеЗаполнено(ИмяПараметра) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Значение = ПараметрыВнешние.Получить(ИмяПараметра);
	Если Не ЗначениеПараметраПередано(Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Период = МС_HTTPAPIКонструкторСервер.ЗначениеПараметраПоТипу(Значение, "ДАТА");
	Если ТипЗнч(Период) <> Тип("Дата") Или Не ЗначениеЗаполнено(Период) Тогда
		ВызватьИсключение СтрШаблон("Параметр ""%1"" должен быть датой в формате ГГГГ-ММ-ДД или ГГГГ-ММ-ДДTчч:мм:сс",
			ИмяПараметра);
	КонецЕсли;

	Возврат Период;

КонецФункции

Процедура ДобавитьУсловиеОтбора(Запрос, Условия, Отбор, ИмяТаблицы, ДанныеНастройки, ПараметрыВнешние)

	ПроверитьИмяПоля(Отбор.Поле);
	Если ДопустимыеСравненияОтбора().Найти(ВРег(Отбор.Сравнение)) = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Недопустимый вид сравнения ""%1"" в отборе по полю %2", Отбор.Сравнение, Отбор.Поле);
	КонецЕсли;

	// Фиксированное значение важнее параметра: переданный параметр его не заменяет.
	Если МС_HTTPAPIКонструкторСервер.ЕстьФиксированноеЗначениеОтбора(Отбор) Тогда
		Значение = МС_HTTPAPIКонструкторСервер.ЗначениеФиксированногоОтбора(Отбор, ИмяТаблицы);
	ИначеЕсли ЗначениеЗаполнено(Отбор.ИмяПараметра) Тогда
		// Обязательные параметры проверены до выполнения; не переданный необязательный параметр отключает отбор.
		Если Не ЗначениеПараметраПередано(ПараметрыВнешние.Получить(Отбор.ИмяПараметра)) Тогда
			Возврат;
		КонецЕсли;
		СтрокаПараметра = НайтиСтрокуПараметраЗапросаПоИмени(ДанныеНастройки.ПараметрыЗапроса, Отбор.ИмяПараметра);
		ТипПараметра = ?(СтрокаПараметра = Неопределено, "", СтрокаПараметра.ТипПараметра);
		Способ = ?(СтрокаПараметра = Неопределено, Неопределено, СтрокаПараметра.СпособСопоставления);
		Значение = МС_HTTPAPIКонструкторСервер.ПривестиСыроеЗначениеПараметраОтбораКТипуПоля(ИмяТаблицы, Отбор.Поле,
			ПараметрыВнешние.Получить(Отбор.ИмяПараметра), ТипПараметра, Способ);
	Иначе
		Возврат;
	КонецЕсли;

	ИмяПараметраЗапроса = "П" + Формат(Условия.Количество() + 1, "ЧГ=0");
	Условия.Добавить(СтрШаблон("Т.%1 %2 &%3", Отбор.Поле, Отбор.Сравнение, ИмяПараметраЗапроса));
	Запрос.УстановитьПараметр(ИмяПараметраЗапроса, Значение);

КонецПроцедуры

Функция ДопустимыеСравненияОтбора()

	Возврат СтрРазделить("=,<>,>,<,>=,<=,ПОДОБНО", ",");

КонецФункции

Процедура ПроверитьИмяПоля(ИмяПоля)
	
	// Имя поля подставляется в текст запроса, поэтому допускаются только идентификаторы через точку.

	Для Каждого Часть Из СтрРазделить(ИмяПоля, ".") Цикл
		Если Часть = "" Или ИзвлечьИмяПараметраЗапросаИзТекста(Часть, 1, СтрДлина(Часть)) <> Часть Тогда
			ВызватьИсключение СтрШаблон("Недопустимое имя поля в настройке конструктора: ""%1""", ИмяПоля);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция РезультатЗапросаВМассивСтруктур(РезультатЗапроса)

	Колонки = РезультатЗапроса.Колонки;
	МассивЭлементов = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Для Каждого Колонка Из Колонки Цикл
			Значение = Выборка[Колонка.Имя];
			Если ТипЗнч(Значение) = Тип("РезультатЗапроса") Тогда
				Значение = РезультатЗапросаВМассивСтруктур(Значение);
			КонецЕсли;
			Элемент.Вставить(Колонка.Имя, Значение);
		КонецЦикла;
		МассивЭлементов.Добавить(Элемент);
	КонецЦикла;

	Возврат МассивЭлементов;

КонецФункции

Функция ИмяСобытияЖурналаРегистрации()

	Возврат "МенеджерСинхронизаций.HTTP API";

КонецФункции

#КонецОбласти

#Область ПараметрыAPI

Функция ИмяПараметраЛимитСтрок()

	Возврат "ЛимитСтрок";

КонецФункции

Функция ИзвлечьИмяПараметраЗапросаИзТекста(Текст, НачальнаяПозиция, ДлинаТекста)

	Если НачальнаяПозиция > ДлинаТекста
		Или Не СимволДопустимВИмениПараметраЗапроса(Сред(Текст, НачальнаяПозиция, 1), Истина) Тогда
		Возврат "";
	КонецЕсли;

	КонецПозиции = НачальнаяПозиция + 1;
	Пока КонецПозиции <= ДлинаТекста И СимволДопустимВИмениПараметраЗапроса(Сред(Текст, КонецПозиции, 1), Ложь) Цикл
		КонецПозиции = КонецПозиции + 1;
	КонецЦикла;

	Возврат Сред(Текст, НачальнаяПозиция, КонецПозиции - НачальнаяПозиция);

КонецФункции

Функция СимволДопустимВИмениПараметраЗапроса(Символ, ЭтоПервый)
	
	// Буквы (латиница, кириллица), подчеркивание; цифры - кроме первого символа.

	Если СтрНайти("0123456789", Символ) > 0 Тогда
		Возврат Не ЭтоПервый;
	КонецЕсли;

	Возврат Символ = "_" Или (ВРег(Символ) <> НРег(Символ));

КонецФункции

Функция ИменаОписанныхПараметров(ПараметрыЗапроса)

	Результат = Новый Соответствие;
	Для Каждого СтрокаПараметра Из ПараметрыЗапроса Цикл
		Имя = СокрЛП(СтрокаПараметра.ИмяПараметра);
		Если ЗначениеЗаполнено(Имя) Тогда
			Результат.Вставить(ВРег(Имя), Имя);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ОписанияПараметровПоИмени(ОбъектНастройки)

	Результат = Новый Соответствие;
	Для Каждого СтрокаПараметра Из ОбъектНастройки.ПараметрыЗапроса Цикл
		Имя = СокрЛП(СтрокаПараметра.ИмяПараметра);
		Если ЗначениеЗаполнено(Имя) Тогда
			Описание = Новый Структура("Обязательный, ТипПараметра, Источник, СпособСопоставления, Описание");
			ЗаполнитьЗначенияСвойств(Описание, СтрокаПараметра);
			Результат.Вставить(Имя, Описание);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ЗаполнитьПараметрыЗапросаПоОтборам(ОбъектНастройки, Отборы)
	
	// Отборы - коллекция элементов со свойствами Поле и ИмяПараметра (структуры или строки таблицы формы).

	СтарыеПараметры = ОписанияПараметровПоИмени(ОбъектНастройки);
	ИмяТаблицы = МС_HTTPAPIКонструкторСервер.ИмяТаблицыНастройки(ОбъектНастройки);

	ОбъектНастройки.ПараметрыЗапроса.Очистить();
	Добавленные = Новый Соответствие;
	Для Каждого Отбор Из Отборы Цикл
		// Строки с фиксированным значением параметр не создают: значение отбора задано в настройке.
		ИмяПараметра = МС_HTTPAPIКонструкторСервер.ИмяПараметраОтбора(Отбор);
		Если Не ЗначениеЗаполнено(ИмяПараметра) Или Добавленные.Получить(ИмяПараметра) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Добавленные.Вставить(ИмяПараметра, Истина);
		ДобавитьПараметрПоОтбору(ОбъектНастройки, ИмяПараметра, СокрЛП(Отбор.Поле), ИмяТаблицы,
			СтарыеПараметры.Получить(ИмяПараметра));
	КонецЦикла;

	// Параметр периода среза регистра сведений.
	ИмяПараметра = СокрЛП(ОбъектНастройки.КонструкторПараметрПериода);
	Если ЗначениеЗаполнено(ИмяПараметра) И Добавленные.Получить(ИмяПараметра) = Неопределено
		И ЗначениеЗаполнено(МС_HTTPAPIКонструкторСервер.ВиртуальнаяТаблицаНастройки(ОбъектНастройки, ИмяТаблицы)) Тогда
		ДобавитьПараметрПериода(ОбъектНастройки, ИмяПараметра, СтарыеПараметры.Получить(ИмяПараметра));
	КонецЕсли;

	СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ОбъектНастройки);

КонецПроцедуры

Процедура ДобавитьПараметрПериода(ОбъектНастройки, ИмяПараметра, СтароеОписание)

	// Тип всегда ДАТА; признак "Обязательный" и собственное описание пользователя сохраняются.

	СтрокаПараметра = ОбъектНастройки.ПараметрыЗапроса.Добавить();
	СтрокаПараметра.ИмяПараметра = ИмяПараметра;
	СтрокаПараметра.ТипПараметра = "ДАТА";
	СтрокаПараметра.Описание = ПрефиксОписанияОтбора() + " период среза, не передан - текущие данные";

	Если СтароеОписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаПараметра.Обязательный = СтароеОписание.Обязательный;
	Если ЗначениеЗаполнено(СтароеОписание.Описание)
		И Не СтрНачинаетсяС(СтароеОписание.Описание, ПрефиксОписанияОтбора()) Тогда
		СтрокаПараметра.Описание = СтароеОписание.Описание;
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПараметрПоОтбору(ОбъектНастройки, ИмяПараметра, Поле, ИмяТаблицы, СтароеОписание)
	
	// Тип и способ сопоставления берутся из метаданных поля; признак "Обязательный", источник,
	// выбранный пользователем способ и собственное описание сохраняются.

	СтрокаПараметра = ОбъектНастройки.ПараметрыЗапроса.Добавить();
	СтрокаПараметра.ИмяПараметра = ИмяПараметра;
	Если ЗначениеЗаполнено(Поле) Тогда
		ОписаниеТипов = МС_HTTPAPIКонструкторСервер.ПолучитьОписаниеТипаПоляТаблицы(ИмяТаблицы, Поле);
		СтрокаПараметра.Описание = ПрефиксОписанияОтбора() + " " + Поле;
		СтрокаПараметра.ТипПараметра = МС_HTTPAPIКонструкторСервер.КраткоеИмяТипаПараметраAPI(ОписаниеТипов);
		СтрокаПараметра.СпособСопоставления =
			МС_HTTPAPIКонструкторСервер.СпособСопоставленияПараметраОтбораПоУмолчанию(ОписаниеТипов);
	КонецЕсли;

	Если СтароеОписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(СтрокаПараметра, СтароеОписание, "Обязательный, Источник");
	Если ЗначениеЗаполнено(СтароеОписание.СпособСопоставления) Тогда
		СтрокаПараметра.СпособСопоставления = СтароеОписание.СпособСопоставления;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаПараметра.ТипПараметра) Тогда
		СтрокаПараметра.ТипПараметра = СтароеОписание.ТипПараметра;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтароеОписание.Описание)
		И Не СтрНачинаетсяС(СтароеОписание.Описание, ПрефиксОписанияОтбора()) Тогда
		СтрокаПараметра.Описание = СтароеОписание.Описание;
	КонецЕсли;

КонецПроцедуры

Функция ПрефиксОписанияОтбора()

	Возврат "Отбор:";

КонецФункции

Функция НайтиСтрокуПараметраЗапросаПоИмени(ПараметрыЗапроса, Знач Имя)

	Имя = ВРег(СокрЛП(Имя));
	Для Каждого СтрокаПараметра Из ПараметрыЗапроса Цикл
		Если ВРег(СокрЛП(СтрокаПараметра.ИмяПараметра)) = Имя Тогда
			Возврат СтрокаПараметра;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область Сериализация

Функция СериализоватьДанные(ДанныеНастройки, Данные)

	Корень = Новый Структура;
	Корень.Вставить("apiVersion", ДанныеНастройки.ВерсияAPI);
	Корень.Вставить("data", Данные);

	Если ДанныеНастройки.ФорматОтвета <> Перечисления.МС_ФорматОтветаAPI.JSON Тогда
		Возврат УпрощенныйXMLИзСтруктуры(Корень);
	КонецЕсли;

	Настройки = НастройкиЗаписиJSON(ДанныеНастройки.JSONПараметрыЗаписи);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSONИзНастроек(Настройки));
	ЗаписатьЗначениеДляJSON(ЗаписьJSON, Корень, Настройки.ФорматДаты);

	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Процедура ЗаписатьЗначениеДляJSON(ЗаписьJSON, Значение, ФорматДаты)

	// Экранирование строк выполняет ЗаписьJSON по параметрам записи настройки.

	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("Соответствие") Тогда
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Для Каждого КлючИЗначение Из Значение Цикл
			ЗаписьJSON.ЗаписатьИмяСвойства(Строка(КлючИЗначение.Ключ));
			ЗаписатьЗначениеДляJSON(ЗаписьJSON, КлючИЗначение.Значение, ФорматДаты);
		КонецЦикла;
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		ЗаписьJSON.ЗаписатьНачалоМассива();
		Для Каждого Элемент Из Значение Цикл
			ЗаписатьЗначениеДляJSON(ЗаписьJSON, Элемент, ФорматДаты);
		КонецЦикла;
		ЗаписьJSON.ЗаписатьКонецМассива();
	ИначеЕсли ТипЗначения = Тип("Строка") Или ТипЗначения = Тип("Число") Или ТипЗначения = Тип("Булево") Тогда
		ЗаписьJSON.ЗаписатьЗначение(Значение);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		ЗаписьJSON.ЗаписатьЗначение(ДатаДляJSON(Значение, ФорматДаты));
	ИначеЕсли Значение = Неопределено Или Значение = NULL Тогда
		ЗаписьJSON.ЗаписатьЗначение(Неопределено);
	Иначе
		ЗаписьJSON.ЗаписатьЗначение(Строка(Значение));
	КонецЕсли;

КонецПроцедуры

Функция ДатаДляJSON(Значение, ФорматДаты)

	// UnixTime - число секунд от 01.01.1970 UTC; иначе ISO 8601 - "2024-01-31T10:00:00" (время сервера).
	// Пустая дата выводится как null.

	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат Неопределено;
	ИначеЕсли ФорматДаты = ФорматДатыUnixTime() Тогда
		Возврат УниверсальноеВремя(Значение) - Дата(1970, 1, 1);
	Иначе
		Возврат XMLСтрока(Значение);
	КонецЕсли;

КонецФункции

Функция ФорматДатыISO8601()

	Возврат "ISO8601";

КонецФункции

Функция ФорматДатыUnixTime()

	Возврат "UnixTime";

КонецФункции

Функция ПараметрыЗаписиJSONИзНастроек(Настройки)

	ВариантыПереноса = Новый Соответствие;
	ВариантыПереноса.Вставить("НЕТ", ПереносСтрокJSON.Нет);
	ВариантыПереноса.Вставить("UNIX", ПереносСтрокJSON.Unix);
	ВариантыПереноса.Вставить("WINDOWS", ПереносСтрокJSON.Windows);
	Перенос = ВариантыПереноса.Получить(ВРег(Настройки.ПереносСтрок));

	ВариантыЭкранирования = Новый Соответствие;
	ВариантыЭкранирования.Вставить("СИМВОЛЫВНЕASCII", ЭкранированиеСимволовJSON.СимволыВнеASCII);
	ВариантыЭкранирования.Вставить("СИМВОЛЫВНЕBMP", ЭкранированиеСимволовJSON.СимволыВнеBMP);
	Экранирование = ВариантыЭкранирования.Получить(ВРег(Настройки.ЭкранированиеСимволов));

	// Реквизит "ЭкранироватьКавычки" исторически хранит параметр ЭкранироватьСлеш.
	Возврат Новый ПараметрыЗаписиJSON(
		?(Перенос = Неопределено, ПереносСтрокJSON.Авто, Перенос),
		Настройки.СимволыОтступа,
		Настройки.ИспользоватьДвойныеКавычки,
		?(Экранирование = Неопределено, ЭкранированиеСимволовJSON.Нет, Экранирование),
		Настройки.ЭкранироватьУгловыеСкобки,
		Настройки.ЭкранироватьРазделительСтрок,
		Настройки.ЭкранироватьАмперсанд,
		Настройки.ЭкранироватьОдинарныеКавычки,
		Настройки.ЭкранироватьКавычки);

КонецФункции

Функция НастройкиЗаписиJSON(СтрокаJSON)

	Результат = НастройкиЗаписиJSONПоУмолчанию();
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда
		Возврат Результат;
	КонецЕсли;

	Попытка
		Сохраненные = JSONВЗначение(СтрокаJSON, Истина);
	Исключение
		Сохраненные = Неопределено;
	КонецПопытки;
	Если ТипЗнч(Сохраненные) <> Тип("Соответствие") Тогда
		Возврат Результат;
	КонецЕсли;

	// Берутся только известные ключи и только значения того же типа, что по умолчанию.
	Настройки = Новый Структура;
	Для Каждого КлючИЗначение Из Результат Цикл
		Значение = Сохраненные.Получить(КлючИЗначение.Ключ);
		Если ТипЗнч(Значение) = ТипЗнч(КлючИЗначение.Значение) Тогда
			Настройки.Вставить(КлючИЗначение.Ключ, Значение);
		Иначе
			Настройки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	Если Настройки.ФорматДаты <> ФорматДатыUnixTime() Тогда
		Настройки.ФорматДаты = ФорматДатыISO8601();
	КонецЕсли;

	Возврат Настройки;

КонецФункции

Функция НастройкиЗаписиJSONПоУмолчанию()

	Результат = Новый Структура;
	Результат.Вставить("ПереносСтрок", "Авто");
	Результат.Вставить("СимволыОтступа", "");
	Результат.Вставить("ИспользоватьДвойныеКавычки", Истина);
	Результат.Вставить("ЭкранированиеСимволов", "Нет");
	Результат.Вставить("ЭкранироватьУгловыеСкобки", Истина);
	Результат.Вставить("ЭкранироватьРазделительСтрок", Истина);
	Результат.Вставить("ЭкранироватьАмперсанд", Истина);
	Результат.Вставить("ЭкранироватьОдинарныеКавычки", Истина);
	Результат.Вставить("ЭкранироватьКавычки", Истина);
	Результат.Вставить("ФорматДаты", ФорматДатыISO8601());

	Возврат Результат;

КонецФункции

Функция УпрощенныйXMLИзСтруктуры(Значение)

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписатьУзелXML(ЗаписьXML, "root", Значение);

	Возврат ЗаписьXML.Закрыть();

КонецФункции

Процедура ЗаписатьУзелXML(ЗаписьXML, Имя, Значение)

	ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("Соответствие") Тогда
		Для Каждого КлючИЗначение Из Значение Цикл
			ЗаписатьУзелXML(ЗаписьXML, Строка(КлючИЗначение.Ключ), КлючИЗначение.Значение);
		КонецЦикла;
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		Для Каждого Элемент Из Значение Цикл
			ЗаписатьУзелXML(ЗаписьXML, "item", Элемент);
		КонецЦикла;
	Иначе
		ЗаписьXML.ЗаписатьТекст(Строка(Значение));
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура УстановитьЗаголовкиОтвета(Ответ, ДанныеНастройки)

	Ответ.Заголовки.Вставить("Content-Type", ТипСодержимогоОтвета(ДанныеНастройки.ФорматОтвета));
	Ответ.Заголовки.Вставить("API-Version", ДанныеНастройки.ВерсияAPI);

КонецПроцедуры

Функция ТипСодержимогоОтвета(ФорматОтвета)

	Если ФорматОтвета = Перечисления.МС_ФорматОтветаAPI.XML Тогда
		Возврат "application/xml; charset=utf-8";
	КонецЕсли;

	Возврат "application/json; charset=utf-8";

КонецФункции

Функция ОтветОшибкиСервиса(КодHTTP, ТекстОшибки, ФорматОтвета, ВерсияAPI)

	СтруктураОшибки = Новый Структура;
	СтруктураОшибки.Вставить("error", Новый Структура("code, message", Строка(КодHTTP), ТекстОшибки));
	СтруктураОшибки.Вставить("apiVersion", ВерсияAPI);

	Если ФорматОтвета = Перечисления.МС_ФорматОтветаAPI.XML Тогда
		Тело = УпрощенныйXMLИзСтруктуры(СтруктураОшибки);
	Иначе
		Тело = ЗначениеВJSON(СтруктураОшибки);
	КонецЕсли;

	Ответ = Новый HTTPСервисОтвет(КодHTTP);
	Ответ.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);
	Ответ.Заголовки.Вставить("Content-Type", ТипСодержимогоОтвета(ФорматОтвета));

	Возврат Ответ;

КонецФункции

Функция JSONВЗначение(СтрокаJSON, ВСоответствие = Ложь)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Результат = ПрочитатьJSON(ЧтениеJSON, ВСоответствие);
	ЧтениеJSON.Закрыть();

	Возврат Результат;

КонецФункции

Функция ЗначениеВJSON(Значение)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);

	Возврат ЗаписьJSON.Закрыть();

КонецФункции

#КонецОбласти

#Область АдресПубликации

Функция АдресПубликацииИнформационнойБазы()

	Адрес = СокрЛП(ОбщегоНазначения.АдресПубликацииИнформационнойБазыВЛокальнойСети());
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Адрес = СокрЛП(ОбщегоНазначения.АдресПубликацииИнформационнойБазыВИнтернете());
	КонецЕсли;
	// Константа адреса веб-клиента есть не во всех конфигурациях (например, есть в Документообороте, нет в ERP).
	ИмяКонстанты = "АдресПубликацииНаВебСервере";
	Если Не ЗначениеЗаполнено(Адрес) И Метаданные.Константы.Найти(ИмяКонстанты) <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Адрес = СокрЛП(Константы[ИмяКонстанты].Получить());
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	// Адрес веб-клиента может заканчиваться на "/#" или "/ru_RU/" - для HTTP-сервиса они не нужны.
	Пока ЗначениеЗаполнено(Адрес) И (Прав(Адрес, 1) = "/" Или Прав(Адрес, 1) = "#") Цикл
		Адрес = Лев(Адрес, СтрДлина(Адрес) - 1);
	КонецЦикла;
	ПозицияСлеша = СтрНайти(Адрес, "/", НаправлениеПоиска.СКонца);
	Если ПозицияСлеша > 0 И ЭтоКодЛокализации(Сред(Адрес, ПозицияСлеша + 1)) Тогда
		Адрес = Лев(Адрес, ПозицияСлеша - 1);
	КонецЕсли;

	Возврат Адрес;

КонецФункции

Функция ЭтоКодЛокализации(Сегмент)
	
	// Сегмент вида "ru_RU".

	Возврат СтрДлина(Сегмент) = СтрДлина("ru_RU") И Сред(Сегмент, 3, 1) = "_";

КонецФункции

#КонецОбласти

#КонецОбласти
